---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.InapplicableDataException
source: html/60383e2b-2431-877f-faf6-dcb07fee85d8.htm
---
# InapplicableDataException Methods

Retrieves data needed to serialize the target object.